Revit 2024 API
Entity.ReadAccessGranted Method
 Checks whether this Entity may be retrieved by the current add-in.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool ReadAccessGranted()
Visual Basic
Public Function ReadAccessGranted As Boolean
Visual C++
public:
bool ReadAccessGranted()
Return Value
 True if read access is allowed.
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace